export const resultText = {
  spring: {
    color: `イエベ春色の特徴はとにかくかわいい。\nパーソナルカラーを取り入れることで\n明るく優しい印象が引き立ちます。`,
    fashion: `若々しくキュートな雰囲気を持つイエベ春は、\n色を沢山使ったファッションも着こなせます。\n春の花や若葉のような明るい色が\n特に得意です。\n\nイエベタイプが得意とするイエローを始め\n暖色系のオレンジやピンク\n明るいグリーンなどがよく似合います。`,
    badFashion: `イエベ春は、青みの強い色や\n重めのダークカラーを顔周りに持ってくると\n肌の透明感が失われ、\n疲れて見えることがあります。\n\nブラックやダークブラウンは\n肌とのコントラストが強く、\n顔色がくすんで見える原因に。\n\n青みピンクやくすみピンクも苦手で、\n地味な印象になりがちです。`,
    hair: `イエベ春のお似合いのカラーは\nベージュ・ブラウン系やピンク系、\nオレンジ系などの温かみのあるカラー。\n\nこなれ感を出すならグレージュ、\n華やかさを目指すなら明るめのベージュなど\nファッションやお仕事・学校の環境に\n合わせると良さそうです。`,
    characteristics: `イエベ春(スプリング)のパーソナルカラーは\n春をイメージさせる\n「明るく鮮やかな色味」が特徴。\n\nパーソナルカラーをうまく取り入れることで\n「かわいい/元気/明るい」印象を\n引き立てることができます。`,
    feature: [
      {
        id: 1,
        text: `・黄みのある明るいトーン\n・皮膚は薄めでツヤがある\n・頬や唇に血色感がある`,
      },
      { id: 2, text: `・繊細な髪質でツヤがある\n・地毛の色がブラウン系` },
      {
        id: 3,
        text: `・瞳は黄みがかったブラウンで明るめ〜暗め\n・瞳の水分量が多くキラキラして見える`,
      },
    ],
    fashionColor: [
      {
        id: 1,
        text: `アイボリー、オフホワイト、ハニーベージュ、キャメル、ミディアムブラウンなど`,
      },
      { id: 2, text: `朱赤、ポピーレッド、スカーレットなど` },
      { id: 3, text: `コーラルピンク、サーモンピンク、ピーチなど` },
      { id: 4, text: `ライトオレンジ、アプリコットなど` },
      { id: 5, text: `ブライトイエロー、カナリーイエロー、サンフラワーなど` },
      {
        id: 6,
        text: `アップルグリーン、ターコイズグリーン、ライムグリーン、イエローグリーンなど`,
      },
      { id: 7, text: `アクアブルー、ターコイズブルー、コバルトブルーなど` },
      { id: 8, text: `パンジー、ライラック、ライトバイオレットなど` },
    ],
  },
  summer: {
    color: `ブルベ夏の特徴はとにかくオシャレ。\nパーソナルカラーを取り入れることで\n優しく鮮やかな印象が引き立ちます。`,
    fashion: `ブルベ夏タイプは、\n涼しげで柔らかい色が似合います。\n明るいくすみカラーや\n寒色系のパステルカラーがぴったり！\n\nコントラストが抑えられた\n淡い色の服でまとめると\n透明感が増して上品な雰囲気に。`,
    badFashion: `ブルベ夏は、黄色やオレンジなどの暖色や\n原色が肌になじまず\n浮いて見えやすい傾向があります。\n\n特にキャメル、ゴールド、ダークブルー、\nカーキなどは相性が良くないです。`,
    hair: `ブルベ夏のお似合いのカラーは\nブルーやグレーをベースにしたダークトーン。\nアッシュやスモーキーカラーなどを配合した\nくすみカラーを選ぶのがおすすめです。\n\n暖色を取り入れるなら、\nグレーやアッシュなどをプラスして\nくすんだ色合いに仕上げるのがベターです。`,
    characteristics: `ブルべ夏(サマー)のパーソナルカラーは\n夏をイメージさせる\n「明るくくすんだ色味」が特徴。\n\nパーソナルカラーをうまく取り入れることで\n「おしゃれ/さわやか/優しい」印象を\n引き立てることができます。`,
    feature: [
      {
        id: 1,
        text: `・肌が薄く透明感があります。\n・色はやや青白くきめ細かい肌質です。\n・色黒の人は少なく、色白の人が多い傾向。`,
      },
      { id: 2, text: `・髪質は細くて柔らかく、地毛の色はグレーよりの黒` },
      {
        id: 3,
        text: `・色は赤みがかったブラウンや薄い黒色。\n・白目とのコントラストが柔らかく、ソフトな印象`,
      },
    ],
    fashionColor: [
      { id: 1, text: `オフホワイト、ココアブラウン、ブルーグレー、ソフトネイビー` },
      {
        id: 2,
        text: `ベビーピンク、ピンクレディ、オペラピンク、スイートピー、オールドローズ`,
      },
      { id: 3, text: `ストロベリー、フランボワーゼ` },
      { id: 4, text: `シトラスイエロー` },
      { id: 5, text: `ペパーミントグリーン、ピーコックグリーン、ターコイズグリーン` },
      { id: 6, text: `ベビーブルー、スカイブルー、ブルーリボン、ロイヤルブルー` },
      { id: 7, text: `ウィステリアミスト、ラベンダー、ラベンダーブルー` },
      { id: 8, text: `シャンパン、ココア、ローズブラウン` },
    ],
  },
  autumn: {
    color:
      'イエベ秋色の特徴はとにかく品がある。\nパーソナルカラーを取り入れることで\n優しく落ち着いた印象があります',
    fashion: `イエベ秋タイプには、ブラウンやカーキを\nベースにコーディネートをまとめると\nぴったりのシックな雰囲気に。\n\n春夏はオレンジ系の色を取り入れれば、\nパッと明るい印象に仕上がります。`,
    badFashion: `青みの強い色や淡いパステルカラーは\n顔がぼやけた印象になりやすく\nビビッドカラーも顔が沈んで見えるため注意。\n\n鮮やかな色を使いたい場合は\nフレッシュなフルーツカラーを選び\n小物で取り入れるのがおすすめ。`,
    hair: `イエベ秋のお似合いのカラーは\n黄味をベースとしつつ、\nくすみがあったり深みがあったりする色。\n\n例えばイエローやゴールドの系統は\nもちろんのこと、トレンドカラーでいえば\nカーキやオリーブの色合いがお似合いです。`,
    characteristics: `イエベ秋(オータム)のパーソナルカラーは\n秋をイメージさせる\n「暗くくすんだ色味」が特徴。\n\nパーソナルカラーをうまく取り入れることで\n「上品/穏やか/落ち着いた」印象を\n引き立てることができます。`,
    feature: [
      {
        id: 1,
        text: `・やや冷たい黄身がかった濃い肌色。\n・質感はマットで、きれいに日焼けする人が多い傾向`,
      },
      {
        id: 2,
        text: `・色はダークブラウン〜黒髪。\n・質感はハリがあり、ツヤは少なめです。`,
      },
      {
        id: 3,
        text: `・ダークブラウン系の色。\n・白目と黒目のコントラストは弱く、落ち着いた印象`,
      },
    ],
    fashionColor: [
      { id: 1, text: `ホワイト、ベージュ、ブラウン、グレー、ネイビー、ブラック` },
      { id: 2, text: `アプリコット、サーモンピンク` },
      { id: 3, text: `カーディナル、カッパーレッド、ブラウンレッド` },
      { id: 4, text: `スイートコーン、サフランイエロー、ゴールド` },
      { id: 5, text: `モスグリーン、カーキ、オリーブ、サバンナ、ジャングルグリーン` },
      { id: 6, text: `パプリカ、ダスティーオレンジ、パンプキン、スパイシーオレンジ` },
      { id: 7, text: `モスグレー、アッシュグレー` },
      { id: 8, text: `カフェモカ、マロン、ブラウンシュガー、ビターチョコレート` },
    ],
  },
  winter: {
    color: `ブルベ冬色の特徴はとにかくクール。\nパーソナルカラーを取り入れることで\nクールで鮮やかな印象が引き立ちます。`,
    fashion: `ブルベ冬タイプには、メリハリがある\nはっきりとした色が似合います。\n具体的には寒色系ビビッドカラーや、\n暗い鮮やかな色です。\n\n青みがかった色を選ぶと、\n肌がより白く艶のある質感に。\n輪郭が引き締まり、顔がスッキリと見えます。`,
    badFashion: `くすんだ色味やパステルカラーが\n不得意な傾向があります。\n\nまた、ブルーベースなので、黄みの強い色を\n取り入れる時も工夫が必要です。`,
    hair: `ブルベ冬はくっきりとした髪色、特に黒髪が\n似合う傾向にあります。\nまた、元の肌色に青みがあるので、\n青みを含んだ寒色系カラーもお似合い。\n\nブラウンやベージュ系にしたい時は\nメリハリのあるダークカラーを\nチョイスするのがおすすめです。`,
    characteristics: `ブルべ冬(ウィンター)のパーソナルカラーは\n冬をイメージさせる\n「暗く鮮やかな色味」が特徴。\n\nパーソナルカラーをうまく取り入れることで\n「華やか/クール/かっこいい」印象を\n引き立てることができます。`,
    feature: [
      {
        id: 1,
        text: `・肌の赤みが少ない\n・色白の場合は、透き通るような白さがある\n（色白と思われがちだが、色白でない場合もあり）\n・頬は青みのあるピンク、または血色がない`,
      },
      { id: 2, text: `・地毛は茶色みの少ない黒髪である場合が多い\n・黒髪が似合う` },
      {
        id: 3,
        text: `・髪と同様に瞳の色も黒である場合が多い\n・白目と黒目のコントラストがはっきりと感じられる`,
      },
    ],
    fashionColor: [
      { id: 1, text: `ブルー` },
      { id: 2, text: `青みのあるベリー系、フューシャピンク、アイシーピンクなど` },
      { id: 3, text: `ロイヤルブルー、ミッドナイトブルー、アイシーブルーなど` },
      { id: 4, text: `黒や白（特にくすみのないスノーホワイトがおすすめ）` },
      { id: 5, text: `パイングリーン、エメラルドグリーンなど` },
      { id: 6, text: `ワインレッド、ローズなど` },
      { id: 7, text: `レモンイエローなど` },
      {
        id: 8,
        text: `クリスタルバイオレッド、グレープワイン、バイオレット、ロイヤルパープル`,
      },
    ],
  },
};
