export const resultText = {
  spring: {
    color: `イエベ春色の特徴はとにかくかわいい。\nパーソナルカラーを取り入れることで\n明るく優しい印象が引き立ちます。`,
    badFashion: `・ダークネイビー／ダークパープル\n明るくフレッシュな印象を持つイエベ春さんは、青みの強い色を顔の近くにもってくると色味がきつく疲れた印象を与えてしまう可能性があります。\n重めの色は、イエベ春さんがもつ透明感を妨げてしまいかねません。

    ・ブラック／ダークブラウン\nブラックやダークブラウンなどのカラーは肌色とのコントラストが強く、顔色がくすんで暗い印象に見えてしまうことも。\nイエベ春さんは肌の色が明るめなので、ファッションも明るく華やかな色の方が似合います。

    ・青みピンク／くすみピンク\nイエベ春さんはピンクの中でも青みピンクやくすみピンクは苦手。\nフレッシュな色合いが得意なイエベ春さんが着ると、顔周りがくすんで地味な印象になります。`,
    hair: `イエベ春さんお似合いのカラーは、ベージュ・ブラウン系やピンク系、オレンジ系などの温かみのあるカラー。\nこなれ感を出すならグレージュ、華やかさを目指すなら明るめのベージュなどファッションやお仕事や学校の環境に合わせて選んでみてください。`,
    feature: [
      {
        id: 1,
        text: `・黄みのある明るいトーン\n・皮膚は薄めでツヤがある\n・頬や唇に血色感がある`,
      },
      { id: 2, text: `・繊細な髪質でツヤがある\n・地毛の色がブラウン系` },
      {
        id: 3,
        text: `・瞳は黄みがかったブラウンで明るめ〜暗め\n・瞳の水分量が多くキラキラして見える`,
      },
    ],
    fashionColor: [
      {
        id: 1,
        text: `アイボリー、オフホワイト、ハニーベージュ、キャメル、ミディアムブラウンなど`,
      },
      { id: 2, text: `朱赤、ポピーレッド、スカーレットなど` },
      { id: 3, text: `コーラルピンク、サーモンピンク、ピーチなど` },
      { id: 4, text: `ライトオレンジ、アプリコットなど` },
      { id: 5, text: `ブライトイエロー、カナリーイエロー、サンフラワーなど` },
      {
        id: 6,
        text: `アップルグリーン、ターコイズグリーン、ライムグリーン、イエローグリーンなど`,
      },
      { id: 7, text: `アクアブルー、ターコイズブルー、コバルトブルーなど` },
      { id: 8, text: `パンジー、ライラック、ライトバイオレットなど` },
    ],
  },
  summer: {
    color: `ブルベ夏の特徴はとにかくオシャレ。\nパーソナルカラーを取り入れることで\n優しく鮮やかな印象が引き立ちます。`,
    badFashion: `黄色 / オレンジ / キャメル / ゴールド / ダークブルー / カーキ\n青み系と反対色である暖色は、ブルベ夏さんの肌に浮いてしまいがち。\nまた、淡い色やくすみ系が得意な分、原色が苦手です。\n黄色、オレンジ、キャメル、ゴールド、ダークブルー、カーキは避けた方が無難です。`,
    hair: `ブルベ夏さんお似合いのカラーは、ブルーやグレーをベースにしたダークトーン。\nアッシュやスモーキーカラーなどを配合したくすみカラーを選ぶのがおすすめです。\n暖色を取り入れるなら、グレーやアッシュなどをプラスしてくすんだ色合いに仕上げるのがベターです。`,
    feature: [
      {
        id: 1,
        text: `・肌が薄く透明感があります。\n・色はやや青白くきめ細かい肌質です。\n・色黒の人は少なく、色白の人が多い傾向。`,
      },
      { id: 2, text: `・髪質は細くて柔らかく、地毛の色はグレーよりの黒` },
      {
        id: 3,
        text: `・色は赤みがかったブラウンや薄い黒色。\n・白目とのコントラストが柔らかく、ソフトな印象`,
      },
    ],
    fashionColor: [
      { id: 1, text: `オフホワイト、ココアブラウン、ブルーグレー、ソフトネイビー` },
      {
        id: 2,
        text: `ベビーピンク、ピンクレディ、オペラピンク、スイートピー、オールドローズ`,
      },
      { id: 3, text: `ストロベリー、フランボワーゼ` },
      { id: 4, text: `シトラスイエロー` },
      { id: 5, text: `ペパーミントグリーン、ピーコックグリーン、ターコイズグリーン` },
      { id: 6, text: `ベビーブルー、スカイブルー、ブルーリボン、ロイヤルブルー` },
      { id: 7, text: `ウィステリアミスト、ラベンダー、ラベンダーブルー` },
      { id: 8, text: `シャンパン、ココア、ローズブラウン` },
    ],
  },
  autumn: {
    badFashion: `青みがかったピンク/ 紫 / 青みの強い色\nパステルカラーのような淡い色も顔がぼやけた印象になってしまいます。\nさらに、ビビッドカラーなどの鮮やかな色も、顔が沈んで見えやすいため注意が必要。\n鮮やかな色を取り入れる場合は、フレッシュなフルーツカラーがおすすめ。\n顔周りは避け、バッグや靴などの小物に取り入れましょう。`,
    hair: `イエベ秋さんお似合いのカラーは、黄味をベースとしつつ、くすみがあったり深みがあったりする色。\n例えばイエローやゴールドの系統はもちろんのこと、トレンドカラーでいえばカーキやオリーブといった色合いがお似合いです。`,
    feature: [
      {
        id: 1,
        text: `・やや冷たい黄身がかった濃い肌色。\n・質感はマットで、きれいに日焼けする人が多い傾向`,
      },
      {
        id: 2,
        text: `・色はダークブラウン〜黒髪。\n・質感はハリがあり、ツヤは少なめです。`,
      },
      {
        id: 3,
        text: `・ダークブラウン系の色。\n・白目と黒目のコントラストは弱く、落ち着いた印象`,
      },
    ],
    fashionColor: [
      { id: 1, text: `ホワイト、ベージュ、ブラウン、グレー、ネイビー、ブラック` },
      { id: 2, text: `アプリコット、サーモンピンク` },
      { id: 3, text: `カーディナル、カッパーレッド、ブラウンレッド` },
      { id: 4, text: `スイートコーン、サフランイエロー、ゴールド` },
      { id: 5, text: `モスグリーン、カーキ、オリーブ、サバンナ、ジャングルグリーン` },
      { id: 6, text: `パプリカ、ダスティーオレンジ、パンプキン、スパイシーオレンジ` },
      { id: 7, text: `モスグレー、アッシュグレー` },
      { id: 8, text: `カフェモカ、マロン、ブラウンシュガー、ビターチョコレート` },
    ],
  },
  winter: {
    color: `ブルベ冬色の特徴はとにかくクール。\nパーソナルカラーを取り入れることで\nクールで鮮やかな印象が引き立ちます。`,
    badFashion: `くすんだ色味やパステルカラーが不得意な傾向があります。\nまた、ブルーベースなので、黄みの強い色を取り入れるときも工夫が必要です。`,
    hair: `ブルベ冬さんはくっきりとした髪色が似合う傾向にあります。中でも特に似合うのが、黒髪。\n実は4つのタイプの中でもブルべ冬は黒髪が似合います。\nまた元の肌色に青みがあるので、青みを含んだ寒色系カラーもお似合い。\n例えばブラウンやベージュ系にしたいときは、メリハリのあるダークカラーをチョイスするのがおすすめです。`,
    feature: [
      {
        id: 1,
        text: `・肌の赤みが少ない\n・色白の場合は、透き通るような白さがある\n（ブルベ冬は色白ばかりと思われがちだが、色白ではない場合がある）\n・頬は青みのあるピンク、または血色がない`,
      },
      { id: 2, text: `・地毛は茶色みの少ない黒髪である場合が多い\n・黒髪が似合う` },
      {
        id: 3,
        text: `・髪と同様に瞳の色も黒である場合が多い\n・白目と黒目のコントラストがはっきりと感じられる`,
      },
    ],
    fashionColor: [
      { id: 1, text: `ブルー` },
      { id: 2, text: `青みのあるベリー系、フューシャピンク、アイシーピンクなど` },
      { id: 3, text: `ロイヤルブルー、ミッドナイトブルー、アイシーブルーなど` },
      { id: 4, text: `黒や白（特にくすみのないスノーホワイトがおすすめ）` },
      { id: 5, text: `パイングリーン、エメラルドグリーンなど` },
      { id: 6, text: `ワインレッド、ローズなど` },
      { id: 7, text: `レモンイエローなど` },
      {
        id: 8,
        text: `クリスタルバイオレッド、グレープワイン、バイオレット、ロイヤルパープル`,
      },
    ],
  },
};
