export const resultText = {
  spring: {
    color: `イエベ春色の特徴はとにかくかわいい。\nパーソナルカラーを取り入れることで\n明るく優しい印象が引き立ちます。`,
    badFashion: `・ダークネイビー／ダークパープル\n明るくフレッシュな印象を持つイエベ春さんは、青みの強い色を顔の近くにもってくると色味がきつく疲れた印象を与えてしまう可能性があります。\n重めの色は、イエベ春さんがもつ透明感を妨げてしまいかねません。

    ・ブラック／ダークブラウン\nブラックやダークブラウンなどのカラーは肌色とのコントラストが強く、顔色がくすんで暗い印象に見えてしまうことも。\nイエベ春さんは肌の色が明るめなので、ファッションも明るく華やかな色の方が似合います。

    ・青みピンク／くすみピンク\nイエベ春さんはピンクの中でも青みピンクやくすみピンクは苦手。\nフレッシュな色合いが得意なイエベ春さんが着ると、顔周りがくすんで地味な印象になります。`,
    hair: `イエベ春さんお似合いのカラーは、ベージュ・ブラウン系やピンク系、オレンジ系などの温かみのあるカラー。\nこなれ感を出すならグレージュ、華やかさを目指すなら明るめのベージュなどファッションやお仕事や学校の環境に合わせて選んでみてください。`,
  },
  summer: {
    color: `ブルベ夏の特徴はとにかくオシャレ。\nパーソナルカラーを取り入れることで\n優しく鮮やかな印象が引き立ちます。`,
    badFashion: `黄色 / オレンジ / キャメル / ゴールド / ダークブルー / カーキ\n青み系と反対色である暖色は、ブルベ夏さんの肌に浮いてしまいがち。\nまた、淡い色やくすみ系が得意な分、原色が苦手です。\n黄色、オレンジ、キャメル、ゴールド、ダークブルー、カーキは避けた方が無難です。`,
    hair: `ブルベ夏さんお似合いのカラーは、ブルーやグレーをベースにしたダークトーン。\nアッシュやスモーキーカラーなどを配合したくすみカラーを選ぶのがおすすめです。\n暖色を取り入れるなら、グレーやアッシュなどをプラスしてくすんだ色合いに仕上げるのがベターです。`,
  },
  autumn: {
    color: `イエベ秋色の特徴はとにかく品がある。\nパーソナルカラーを取り入れることで\n優しく落ち着いた印象が引き立ちます。`,
    badFashion: `青みがかったピンク/ 紫 / 青みの強い色\nパステルカラーのような淡い色も顔がぼやけた印象になってしまいます。\nさらに、ビビッドカラーなどの鮮やかな色も、顔が沈んで見えやすいため注意が必要。\n鮮やかな色を取り入れる場合は、フレッシュなフルーツカラーがおすすめ。\n顔周りは避け、バッグや靴などの小物に取り入れましょう。
`,
    hair: `イエベ秋さんお似合いのカラーは、黄味をベースとしつつ、くすみがあったり深みがあったりする色。\n例えばイエローやゴールドの系統はもちろんのこと、トレンドカラーでいえばカーキやオリーブといった色合いがお似合いです。`,
  },
  winter: {
    color: `ブルベ冬色の特徴はとにかくクール。\nパーソナルカラーを取り入れることで\nクールで鮮やかな印象が引き立ちます。`,
    badFashion: `くすんだ色味やパステルカラーが不得意な傾向があります。\nまた、ブルーベースなので、黄みの強い色を取り入れるときも工夫が必要です。`,
    hair: `ブルベ冬さんはくっきりとした髪色が似合う傾向にあります。中でも特に似合うのが、黒髪。\n実は4つのタイプの中でもブルべ冬は黒髪が似合います。\nまた元の肌色に青みがあるので、青みを含んだ寒色系カラーもお似合い。\n例えばブラウンやベージュ系にしたいときは、メリハリのあるダークカラーをチョイスするのがおすすめです。`,
  },
};
