export const resultText = {
  spring: {
    hair: `イエベ春さんお似合いのカラーは、ベージュ・ブラウン系やピンク系、オレンジ系などの温かみのあるカラー。\nこなれ感を出すならグレージュ、華やかさを目指すなら明るめのベージュなどファッションやお仕事や学校の環境に合わせて選んでみてください。`,
  },
  summer: {
    hair: `ブルベ夏さんお似合いのカラーは、ブルーやグレーをベースにしたダークトーン。\nアッシュやスモーキーカラーなどを配合したくすみカラーを選ぶのがおすすめです。\n暖色を取り入れるなら、グレーやアッシュなどをプラスしてくすんだ色合いに仕上げるのがベターです。`,
  },
  autumn: {
    hair: `イエベ秋さんお似合いのカラーは、黄味をベースとしつつ、くすみがあったり深みがあったりする色。\n例えばイエローやゴールドの系統はもちろんのこと、トレンドカラーでいえばカーキやオリーブといった色合いがお似合いです。`,
  },
  winter: {
    hair: `ブルベ冬さんはくっきりとした髪色が似合う傾向にあります。中でも特に似合うのが、黒髪。\n実は4つのタイプの中でもブルべ冬は黒髪が似合います。\nまた元の肌色に青みがあるので、青みを含んだ寒色系カラーもお似合い。\n例えばブラウンやベージュ系にしたいときは、メリハリのあるダークカラーをチョイスするのがおすすめです。`,
  },
};
